app/controllers/home_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = 'admin@example.com' LIMIT 1
SELECT "customers".* FROM "customers" WHERE "customers"."email" = 'admin@example.com' ORDER BY first_name asc, last_name asc LIMIT 1
---
  def login
    cookies.delete :c_user if params[:key] && cookies[:c_user]
    @c_user = Customer.find_by_email(cookies[:c_user]) || Admin.find_by_email(cookies[:c_user]) if cookies[:c_user]