app/controllers/sessions_controller.rb

  def create
    customer = Customer.where("email = ? OR mobile_no = ?", params[:customer][:login], params[:customer][:login])
    admin = Admin.where(email: params[:customer][:login])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = '' LIMIT 1